Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment
Indicates whether a face of the solid analyzed by ExtrusionAnalyzer is fully aligned, partially aligned, or unaligned with faces of the extrusion.
Since:
2012

Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment.Unaligned
The face is not aligned with any faces of the extrusion.

Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment.PartiallyAligned
The face is only partially aligned with faces of the extrusion.

Autodesk.Revit.DB.ExtrusionAnalyzerFaceAlignment.FullyAligned
The face is fully aligned with faces of the extrusion.